[
    "Theme Auto Light Dark Table of Contents socket â\u0080\u0094 Low-level networking interface Socket families Module contents Exceptions Constants Functions Creating sockets Other functions Socket Objects Notes on socket timeouts Timeouts and the connect method Timeouts and the accept method Example Previous topic Developing with asyncio Next topic ssl â\u0080\u0094 TLS/SSL wrapper for socket objects This page Report a bug Show source Navigation index modules | next | previous | Python » 3.13.7 Documentation » The Python Standard Library » Networking and Interprocess Communication » socket â\u0080\u0094 Low-level networking interface | Theme Auto Light Dark | socket â\u0080\u0094 Low-level networking interface Â¶ Source code: Lib/socket.py This module provides access to the BSD socket interface. It is available on\nall modern Unix systems, Windows, MacOS, and probably additional platforms. Note Some behavior may be platform dependent, since calls are made to the operating\nsystem socket APIs. Availability : not WASI. This module does not work or is not available on WebAssembly. See WebAssembly platforms for more information. The Python interface is a straightforward transliteration of the Unix system\ncall and library interface for sockets to Pythonâ\u0080\u0099s object-oriented style: the socket() function returns a socket object whose methods implement\nthe various socket system calls.  Parameter types are somewhat higher-level than\nin the C interface: as with read() and write() operations on Python\nfiles, buffer allocation on receive operations is automatic, and buffer length\nis implicit on send operations. See also Module socketserver Classes that simplify writing network servers. Module ssl A TLS/SSL wrapper for socket objects. Socket families Â¶ Depending on the system and the build options, various socket families\nare supported by this module. The address format required by a particular socket object is automatically\nselected based on the address family specified when the socket object was\ncreated.  Socket addresses are represented as follows: The address of an AF_UNIX socket bound to a file system node\nis represented as a string, using the file system encoding and the 'surrogateescape' error handler (see PEP 383 ).  An address in\nLinuxâ\u0080\u0099s abstract namespace is returned as a bytes-like object with\nan initial null byte; note that sockets in this namespace can\ncommunicate with normal file system sockets, so programs intended to\nrun on Linux may need to deal with both types of address.  A string or\nbytes-like object can be used for either type of address when\npassing it as an argument. Changed in version 3.3: Previously, AF_UNIX socket paths were assumed to use UTF-8\nencoding. Changed in version 3.5: Writable bytes-like object is now accepted. A pair (host, port) is used for the AF_INET address family,\nwhere host is a string representing either a hostname in internet domain\nnotation like 'daring.cwi.nl' or an IPv4 address like '100.50.200.5' ,\nand port is an integer. For IPv4 addresses, two special forms are accepted instead of a host\naddress: '' represents INADDR_ANY , which is used to bind to all\ninterfaces, and the string '<broadcast>' represents INADDR_BROADCAST .  This behavior is not compatible with IPv6,\ntherefore, you may want to avoid these if you intend to support IPv6 with your\nPython programs. For AF_INET6 address family, a four-tuple (host, port, flowinfo, scope_id) is used, where flowinfo and scope_id represent the sin6_flowinfo and sin6_scope_id members in struct sockaddr_in6 in C.  For socket module methods, flowinfo and scope_id can be omitted just for\nbackward compatibility.  Note, however, omission of scope_id can cause problems\nin manipulating scoped IPv6 addresses. Changed in version 3.7: For multicast addresses (with scope_id meaningful) address may not contain %scope_id (or zone id ) part. This information is superfluous and may\nbe safely omitted (recommended). AF_NETLINK sockets are represented as pairs (pid, groups) . Linux-only support for TIPC is available using the AF_TIPC address family.  TIPC is an open, non-IP based networked protocol designed\nfor use in clustered computer environments.  Addresses are represented by a\ntuple, and the fields depend on the address type. The general tuple form is (addr_type, v1, v2, v3 [, scope]) , where: addr_type is one of TIPC_ADDR_NAMESEQ , TIPC_ADDR_NAME ,\nor TIPC_ADDR_ID . scope is one of TIPC_ZONE_SCOPE , TIPC_CLUSTER_SCOPE , and TIPC_NODE_SCOPE . If addr_type is TIPC_ADDR_NAME , then v1 is the server type, v2 is\nthe port identifier, and v3 should be 0. If addr_type is TIPC_ADDR_NAMESEQ , then v1 is the server type, v2 is the lower port number, and v3 is the upper port number. If addr_type is TIPC_ADDR_ID , then v1 is the node, v2 is the\nreference, and v3 should be set to 0. A tuple (interface, ) is used for the AF_CAN address family,\nwhere interface is a string representing a network interface name like 'can0' . The network interface name '' can be used to receive packets\nfrom all network interfaces of this family. CAN_ISOTP protocol require a tuple (interface, rx_addr, tx_addr) where both additional parameters are unsigned long integer that represent a\nCAN identifier (standard or extended). CAN_J1939 protocol require a tuple (interface, name, pgn, addr) where additional parameters are 64-bit unsigned integer representing the\nECU name, a 32-bit unsigned integer representing the Parameter Group Number\n(PGN), and an 8-bit integer representing the address. A string or a tuple (id, unit) is used for the SYSPROTO_CONTROL protocol of the PF_SYSTEM family. The string is the name of a\nkernel control using a dynamically assigned ID. The tuple can be used if ID\nand unit number of the kernel control are known or if a registered ID is\nused. Added in version 3.3. AF_BLUETOOTH supports the following protocols and address\nformats: BTPROTO_L2CAP accepts (bdaddr, psm) where bdaddr is\nthe Bluetooth address as a string and psm is an integer. BTPROTO_RFCOMM accepts (bdaddr, channel) where bdaddr is the Bluetooth address as a string and channel is an integer. BTPROTO_HCI accepts a format that depends on your OS. On Linux it accepts a tuple (device_id,) where device_id is an integer specifying the number of the Bluetooth device. On FreeBSD, NetBSD and DragonFly BSD it accepts bdaddr where bdaddr is the Bluetooth address as a string. Changed in version 3.2: NetBSD and DragonFlyBSD support added. Changed in version 3.13.3: FreeBSD support added. BTPROTO_SCO accepts bdaddr where bdaddr is\nthe Bluetooth address as a string or a bytes object.\n(ex. '12:23:34:45:56:67' or b'12:23:34:45:56:67' )\nThis protocol is not supported under FreeBSD. AF_ALG is a Linux-only socket based interface to Kernel\ncryptography. An algorithm socket is configured with a tuple of two to four\nelements (type, name [, feat [, mask]]) , where: type is the algorithm type as string, e.g. aead , hash , skcipher or rng . name is the algorithm name and operation mode as string, e.g. sha256 , hmac(sha256) , cbc(aes) or drbg_nopr_ctr_aes256 . feat and mask are unsigned 32bit integers. Availability : Linux >= 2.6.38. Some algorithm types require more recent Kernels. Added in version 3.6. AF_VSOCK allows communication between virtual machines and\ntheir hosts. The sockets are represented as a (CID, port) tuple\nwhere the context ID or CID and port are integers. Availability : Linux >= 3.9 See vsock(7) Added in version 3.7. AF_PACKET is a low-level interface directly to network devices.\nThe addresses are represented by the tuple (ifname, proto[, pkttype[, hatype[, addr]]]) where: ifname - String specifying the device name. proto - The Ethernet protocol number.\nMay be ETH_P_ALL to capture all protocols,\none of the ETHERTYPE_* constants or any other Ethernet protocol number. pkttype - Optional integer specifying the packet type: PACKET_HOST (the default) - Packet addressed to the local host. PACKET_BROADCAST - Physical-layer broadcast packet. PACKET_MULTICAST - Packet sent to a physical-layer multicast address. PACKET_OTHERHOST - Packet to some other host that has been caught by\na device driver in promiscuous mode. PACKET_OUTGOING - Packet originating from the local host that is\nlooped back to a packet socket. hatype - Optional integer specifying the ARP hardware address type. addr - Optional bytes-like object specifying the hardware physical\naddress, whose interpretation depends on the device. Availability : Linux >= 2.2. AF_QIPCRTR is a Linux-only socket based interface for communicating\nwith services running on co-processors in Qualcomm platforms. The address\nfamily is represented as a (node, port) tuple where the node and port are non-negative integers. Availability : Linux >= 4.7. Added in version 3.8. IPPROTO_UDPLITE is a variant of UDP which allows you to specify\nwhat portion of a packet is covered with the checksum. It adds two socket\noptions that you can change. self.setsockopt(IPPROTO_UDPLITE, UDPLITE_SEND_CSCOV, length) will\nchange what portion of outgoing packets are covered by the checksum and self.setsockopt(IPPROTO_UDPLITE, UDPLITE_RECV_CSCOV, length) will\nfilter out packets which cover too little of their data. In both cases length should be in range(8, 2**16, 8) . Such a socket should be constructed with socket(AF_INET, SOCK_DGRAM, IPPROTO_UDPLITE) for IPv4 or socket(AF_INET6, SOCK_DGRAM, IPPROTO_UDPLITE) for IPv6. Availability : Linux >= 2.6.20, FreeBSD >= 10.1 Added in version 3.9. AF_HYPERV is a Windows-only socket based interface for communicating\nwith Hyper-V hosts and guests. The address family is represented as a (vm_id, service_id) tuple where the vm_id and service_id are\nUUID strings. The vm_id is the virtual machine identifier or a set of known VMID values\nif the target is not a specific virtual machine. Known VMID constants\ndefined on socket are: HV_GUID_ZERO HV_GUID_BROADCAST HV_GUID_WILDCARD - Used to bind on itself and accept connections from\nall partitions. HV_GUID_CHILDREN - Used to bind on itself and accept connection from\nchild partitions. HV_GUID_LOOPBACK - Used as a target to itself. HV_GUID_PARENT - When used as a bind accepts connection from the parent\npartition. When used as an address target it will connect to the parent partition. The service_id is the service identifier of the registered service. Added in version 3.12. If you use a hostname in the host portion of IPv4/v6 socket address, the\nprogram may show a nondeterministic behavior, as Python uses the first address\nreturned from the DNS resolution.  The socket address will be resolved\ndifferently into an actual IPv4/v6 address, depending on the results from DNS\nresolution and/or the host configuration.  For deterministic behavior use a\nnumeric address in host portion. All errors raise exceptions.  The normal exceptions for invalid argument types\nand out-of-memory conditions can be raised. Errors\nrelated to socket or address semantics raise OSError or one of its\nsubclasses. Non-blocking mode is supported through setblocking() .  A\ngeneralization of this based on timeouts is supported through settimeout() . Module contents Â¶ The module socket exports the following elements. Exceptions Â¶ exception socket. error Â¶ A deprecated alias of OSError . Changed in version 3.3: Following PEP 3151 , this class was made an alias of OSError . exception socket. herror Â¶ A subclass of OSError , this exception is raised for\naddress-related errors, i.e. for functions that use h_errno in the POSIX\nC API, including gethostbyname_ex() and gethostbyaddr() .\nThe accompanying value is a pair (h_errno, string) representing an\nerror returned by a library call. h_errno is a numeric value, while string represents the description of h_errno , as returned by the hstrerror() C function. Changed in version 3.3: This class was made a subclass of OSError . exception socket. gaierror Â¶ A subclass of OSError , this exception is raised for\naddress-related errors by getaddrinfo() and getnameinfo() .\nThe accompanying value is a pair (error, string) representing an error\nreturned by a library call. string represents the description of error , as returned by the gai_strerror() C function.  The\nnumeric error value will match one of the EAI_* constants\ndefined in this module. Changed in version 3.3: This class was made a subclass of OSError . exception socket. timeout Â¶ A deprecated alias of TimeoutError . A subclass of OSError , this exception is raised when a timeout\noccurs on a socket which has had timeouts enabled via a prior call to settimeout() (or implicitly through setdefaulttimeout() ).  The accompanying value is a string\nwhose value is currently always â\u0080\u009ctimed outâ\u0080\u009d. Changed in version 3.3: This class was made a subclass of OSError . Changed in version 3.10: This class was made an alias of TimeoutError . Constants Â¶ The AF_* and SOCK_* constants are now AddressFamily and SocketKind IntEnum collections. Added in version 3.4. socket. AF_UNIX Â¶ socket. AF_INET Â¶ socket. AF_INET6 Â¶ These constants represent the address (and protocol) families, used for the\nfirst argument to socket() .  If the AF_UNIX constant is not\ndefined then this protocol is unsupported.  More constants may be available\ndepending on the system. socket. AF_UNSPEC Â¶ AF_UNSPEC means that getaddrinfo() should return socket addresses for any\naddress family (either IPv4, IPv6, or any other) that can be used. socket. SOCK_STREAM Â¶ socket. SOCK_DGRAM Â¶ socket. SOCK_RAW Â¶ socket. SOCK_RDM Â¶ socket. SOCK_SEQPACKET Â¶ These constants represent the socket types, used for the second argument to socket() .  More constants may be available depending on the system.\n(Only SOCK_STREAM and SOCK_DGRAM appear to be generally\nuseful.) socket. SOCK_CLOEXEC Â¶ socket. SOCK_NONBLOCK Â¶ These two constants, if defined, can be combined with the socket types and\nallow you to set some flags atomically (thus avoiding possible race\nconditions and the need for separate calls). See also Secure File Descriptor Handling for a more thorough explanation. Availability : Linux >= 2.6.27. Added in version 3.2. SO_* socket. SOMAXCONN Â¶ MSG_* SOL_* SCM_* IPPROTO_* IPPORT_* INADDR_* IP_* IPV6_* EAI_* AI_* NI_* TCP_* Many constants of these forms, documented in the Unix documentation on sockets\nand/or the IP protocol, are also defined in the socket module. They are\ngenerally used in arguments to the setsockopt() and getsockopt() methods of socket objects.  In most cases, only those symbols that are defined\nin the Unix header files are defined; for a few symbols, default values are\nprovided. Changed in version 3.6: SO_DOMAIN , SO_PROTOCOL , SO_PEERSEC , SO_PASSSEC , TCP_USER_TIMEOUT , TCP_CONGESTION were added. Changed in version 3.6.5: On Windows, TCP_FASTOPEN , TCP_KEEPCNT appear if run-time Windows\nsupports. Changed in version 3.7: TCP_NOTSENT_LOWAT was added. On Windows, TCP_KEEPIDLE , TCP_KEEPINTVL appear if run-time Windows\nsupports. Changed in version 3.10: IP_RECVTOS was added.\n Added TCP_KEEPALIVE . On MacOS this constant can be used in the same\n way that TCP_KEEPIDLE is used on Linux. Changed in version 3.11: Added TCP_CONNECTION_INFO . On MacOS this constant can be used in the\nsame way that TCP_INFO is used on Linux and BSD. Changed in version 3.12: Added SO_RTABLE and SO_USER_COOKIE . On OpenBSD\nand FreeBSD respectively those constants can be used in the same way that SO_MARK is used on Linux. Also added missing TCP socket options from\nLinux: TCP_MD5SIG , TCP_THIN_LINEAR_TIMEOUTS , TCP_THIN_DUPACK , TCP_REPAIR , TCP_REPAIR_QUEUE , TCP_QUEUE_SEQ , TCP_REPAIR_OPTIONS , TCP_TIMESTAMP , TCP_CC_INFO , TCP_SAVE_SYN , TCP_SAVED_SYN , TCP_REPAIR_WINDOW , TCP_FASTOPEN_CONNECT , TCP_ULP , TCP_MD5SIG_EXT , TCP_FASTOPEN_KEY , TCP_FASTOPEN_NO_COOKIE , TCP_ZEROCOPY_RECEIVE , TCP_INQ , TCP_TX_DELAY .\nAdded IP_PKTINFO , IP_UNBLOCK_SOURCE , IP_BLOCK_SOURCE , IP_ADD_SOURCE_MEMBERSHIP , IP_DROP_SOURCE_MEMBERSHIP . Changed in version 3.13: Added SO_BINDTOIFINDEX . On Linux this constant can be used in the\nsame way that SO_BINDTODEVICE is used, but with the index of a\nnetwork interface instead of its name. socket. AF_CAN Â¶ socket. PF_CAN Â¶ SOL_CAN_* CAN_* Many constants of these forms, documented in the Linux documentation, are\nalso defined in the socket module. Availability : Linux >= 2.6.25, NetBSD >= 8. Added in version 3.3. Changed in version 3.11: NetBSD support was added. Changed in version 3.13.4: Restored missing CAN_RAW_ERR_FILTER on Linux. socket. CAN_BCM Â¶ CAN_BCM_* CAN_BCM, in the CAN protocol family, is the broadcast manager (BCM) protocol.\nBroadcast manager constants, documented in the Linux documentation, are also\ndefined in the socket module. Availability : Linux >= 2.6.25. Note The CAN_BCM_CAN_FD_FRAME flag is only available on Linux >= 4.8. Added in version 3.4. socket. CAN_RAW_FD_FRAMES Â¶ Enables CAN FD support in a CAN_RAW socket. This is disabled by default.\nThis allows your application to send both CAN and CAN FD frames; however,\nyou must accept both CAN and CAN FD frames when reading from the socket. This constant is documented in the Linux documentation. Availability : Linux >= 3.6. Added in version 3.5. socket. CAN_RAW_JOIN_FILTERS Â¶ Joins the applied CAN filters such that only CAN frames that match all\ngiven CAN filters are passed to user space. This constant is documented in the Linux documentation. Availability : Linux >= 4.1. Added in version 3.9. socket. CAN_ISOTP Â¶ CAN_ISOTP, in the CAN protocol family, is the ISO-TP (ISO 15765-2) protocol.\nISO-TP constants, documented in the Linux documentation. Availability : Linux >= 2.6.25. Added in version 3.7. socket. CAN_J1939 Â¶ CAN_J1939, in the CAN protocol family, is the SAE J1939 protocol.\nJ1939 constants, documented in the Linux documentation. Availability : Linux >= 5.4. Added in version 3.9. socket. AF_DIVERT Â¶ socket. PF_DIVERT Â¶ These two constants, documented in the FreeBSD divert(4) manual page, are\nalso defined in the socket module. Availability : FreeBSD >= 14.0. Added in version 3.12. socket. AF_PACKET Â¶ socket. PF_PACKET Â¶ PACKET_* Many constants of these forms, documented in the Linux documentation, are\nalso defined in the socket module. Availability : Linux >= 2.2. socket. ETH_P_ALL Â¶ ETH_P_ALL can be used in the socket constructor as proto for the AF_PACKET family in order to\ncapture every packet, regardless of protocol. For more information, see the packet(7) manpage. Availability : Linux. Added in version 3.12. socket. AF_RDS Â¶ socket. PF_RDS Â¶ socket. SOL_RDS Â¶ RDS_* Many constants of these forms, documented in the Linux documentation, are\nalso defined in the socket module. Availability : Linux >= 2.6.30. Added in version 3.3. socket. SIO_RCVALL Â¶ socket. SIO_KEEPALIVE_VALS Â¶ socket. SIO_LOOPBACK_FAST_PATH Â¶ RCVALL_* Constants for Windowsâ\u0080\u0099 WSAIoctl(). The constants are used as arguments to the ioctl() method of socket objects. Changed in version 3.6: SIO_LOOPBACK_FAST_PATH was added. TIPC_* TIPC related constants, matching the ones exported by the C socket API. See\nthe TIPC documentation for more information. socket. AF_ALG Â¶ socket. SOL_ALG Â¶ ALG_* Constants for Linux Kernel cryptography. Availability : Linux >= 2.6.38. Added in version 3.6. socket. AF_VSOCK Â¶ socket. IOCTL_VM_SOCKETS_GET_LOCAL_CID Â¶ VMADDR* SO_VM* Constants for Linux host/guest communication. Availability : Linux >= 4.8. Added in version 3.7. socket. AF_LINK Â¶ Availability : BSD, macOS. Added in version 3.4. socket. has_ipv6 Â¶ This constant contains a boolean value which indicates if IPv6 is supported on\nthis platform. socket. BDADDR_ANY Â¶ socket. BDADDR_LOCAL Â¶ These are string constants containing Bluetooth addresses with special\nmeanings. For example, BDADDR_ANY can be used to indicate\nany address when specifying the binding socket with BTPROTO_RFCOMM . socket. HCI_FILTER Â¶ socket. HCI_TIME_STAMP Â¶ socket. HCI_DATA_DIR Â¶ For use with BTPROTO_HCI . HCI_FILTER is only\navailable on Linux and FreeBSD. HCI_TIME_STAMP and HCI_DATA_DIR are only available on Linux. socket. AF_QIPCRTR Â¶ Constant for Qualcommâ\u0080\u0099s IPC router protocol, used to communicate with\nservice providing remote processors. Availability : Linux >= 4.7. socket. SCM_CREDS2 Â¶ socket. LOCAL_CREDS Â¶ socket. LOCAL_CREDS_PERSISTENT Â¶ LOCAL_CREDS and LOCAL_CREDS_PERSISTENT can be used\nwith SOCK_DGRAM, SOCK_STREAM sockets, equivalent to\nLinux/DragonFlyBSD SO_PASSCRED, while LOCAL_CREDS\nsends the credentials at first read, LOCAL_CREDS_PERSISTENT\nsends for each read, SCM_CREDS2 must be then used for\nthe latter for the message type. Added in version 3.11. Availability : FreeBSD. socket. SO_INCOMING_CPU Â¶ Constant to optimize CPU locality, to be used in conjunction with SO_REUSEPORT . Added in version 3.11. Availability : Linux >= 3.9 socket. AF_HYPERV Â¶ socket. HV_PROTOCOL_RAW Â¶ socket. HVSOCKET_CONNECT_TIMEOUT Â¶ socket. HVSOCKET_CONNECT_TIMEOUT_MAX Â¶ socket. HVSOCKET_CONNECTED_SUSPEND Â¶ socket. HVSOCKET_ADDRESS_FLAG_PASSTHRU Â¶ socket. HV_GUID_ZERO Â¶ socket. HV_GUID_WILDCARD Â¶ socket. HV_GUID_BROADCAST Â¶ socket. HV_GUID_CHILDREN Â¶ socket. HV_GUID_LOOPBACK Â¶ socket. HV_GUID_PARENT Â¶ Constants for Windows Hyper-V sockets for host/guest communications. Availability : Windows. Added in version 3.12. socket. ETHERTYPE_ARP Â¶ socket. ETHERTYPE_IP Â¶ socket. ETHERTYPE_IPV6 Â¶ socket. ETHERTYPE_VLAN Â¶ IEEE 802.3 protocol number .\nconstants. Availability : Linux, FreeBSD, macOS. Added in version 3.12. socket. SHUT_RD Â¶ socket. SHUT_WR Â¶ socket. SHUT_RDWR Â¶ These constants are used by the shutdown() method of socket objects. Availability : not WASI. Functions Â¶ Creating sockets Â¶ The following functions all create socket objects . class socket. socket ( family = AF_INET , type = SOCK_STREAM , proto = 0 , fileno = None ) Â¶ Create a new socket using the given address family, socket type and protocol\nnumber.  The address family should be AF_INET (the default), AF_INET6 , AF_UNIX , AF_CAN , AF_PACKET ,\nor AF_RDS . The socket type should be SOCK_STREAM (the\ndefault), SOCK_DGRAM , SOCK_RAW or perhaps one of the other SOCK_ constants. The protocol number is usually zero and may be omitted\nor in the case where the address family is AF_CAN the protocol\nshould be one of CAN_RAW , CAN_BCM , CAN_ISOTP or CAN_J1939 . If fileno is specified, the values for family , type , and proto are\nauto-detected from the specified file descriptor.  Auto-detection can be\noverruled by calling the function with explicit family , type , or proto arguments.  This only affects how Python represents e.g. the return value\nof socket.getpeername() but not the actual OS resource.  Unlike socket.fromfd() , fileno will return the same socket and not a\nduplicate. This may help close a detached socket using socket.close() . The newly created socket is non-inheritable . Raises an auditing event socket.__new__ with arguments self , family , type , protocol . Changed in version 3.3: The AF_CAN family was added.\nThe AF_RDS family was added. Changed in version 3.4: The CAN_BCM protocol was added. Changed in version 3.4: The returned socket is now non-inheritable. Changed in version 3.7: The CAN_ISOTP protocol was added. Changed in version 3.7: When SOCK_NONBLOCK or SOCK_CLOEXEC bit flags are applied to type they are cleared, and socket.type will not reflect them.  They are still passed\nto the underlying system socket() call.  Therefore, sock = socket . socket ( socket . AF_INET , socket . SOCK_STREAM | socket . SOCK_NONBLOCK ) will still create a non-blocking socket on OSes that support SOCK_NONBLOCK , but sock.type will be set to socket.SOCK_STREAM . Changed in version 3.9: The CAN_J1939 protocol was added. Changed in version 3.10: The IPPROTO_MPTCP protocol was added. socket. socketpair ( [ family [ , type [ , proto ] ] ] ) Â¶ Build a pair of connected socket objects using the given address family, socket\ntype, and protocol number.  Address family, socket type, and protocol number are\nas for the socket() function above. The default family is AF_UNIX if defined on the platform; otherwise, the default is AF_INET . The newly created sockets are non-inheritable . Changed in version 3.2: The returned socket objects now support the whole socket API, rather\nthan a subset. Changed in version 3.4: The returned sockets are now non-inheritable. Changed in version 3.5: Windows support added. socket. create_connection ( address , timeout = GLOBAL_DEFAULT , source_address = None , * , all_errors = False ) Â¶ Connect to a TCP service listening on the internet address (a 2-tuple (host, port) ), and return the socket object.  This is a higher-level\nfunction than socket.connect() : if host is a non-numeric hostname,\nit will try to resolve it for both AF_INET and AF_INET6 ,\nand then try to connect to all possible addresses in turn until a\nconnection succeeds.  This makes it easy to write clients that are\ncompatible to both IPv4 and IPv6. Passing the optional timeout parameter will set the timeout on the\nsocket instance before attempting to connect.  If no timeout is\nsupplied, the global default timeout setting returned by getdefaulttimeout() is used. If supplied, source_address must be a 2-tuple (host, port) for the\nsocket to bind to as its source address before connecting.  If host or port\nare â\u0080\u0098â\u0080\u0099 or 0 respectively the OS default behavior will be used. When a connection cannot be created, an exception is raised. By default,\nit is the exception from the last address in the list. If all_errors is True , it is an ExceptionGroup containing the errors of all\nattempts. Changed in version 3.2: source_address was added. Changed in version 3.11: all_errors was added. socket. create_server ( address , * , family = AF_INET , backlog = None , reuse_port = False , dualstack_ipv6 = False ) Â¶ Convenience function which creates a TCP socket bound to address (a 2-tuple (host, port) ) and returns the socket object. family should be either AF_INET or AF_INET6 . backlog is the queue size passed to socket.listen() ; if not specified\n, a default reasonable value is chosen. reuse_port dictates whether to set the SO_REUSEPORT socket option. If dualstack_ipv6 is true, family is AF_INET6 and the platform\nsupports it the socket will be able to accept both IPv4 and IPv6 connections,\nelse it will raise ValueError . Most POSIX platforms and Windows are\nsupposed to support this functionality.\nWhen this functionality is enabled the address returned by socket.getpeername() when an IPv4 connection occurs will be an IPv6\naddress represented as an IPv4-mapped IPv6 address.\nIf dualstack_ipv6 is false it will explicitly disable this functionality\non platforms that enable it by default (e.g. Linux).\nThis parameter can be used in conjunction with has_dualstack_ipv6() : import socket addr = ( \"\" , 8080 ) # all interfaces, port 8080 if socket . has_dualstack_ipv6 (): s = socket . create_server ( addr , family = socket . AF_INET6 , dualstack_ipv6 = True ) else : s = socket . create_server ( addr ) Note On POSIX platforms the SO_REUSEADDR socket option is set in order to\nimmediately reuse previous sockets which were bound on the same address and remained in TIME_WAIT state. Added in version 3.8. socket. has_dualstack_ipv6 ( ) Â¶ Return True if the platform supports creating a TCP socket which can\nhandle both IPv4 and IPv6 connections. Added in version 3.8. socket. fromfd ( fd , family , type , proto = 0 ) Â¶ Duplicate the file descriptor fd (an integer as returned by a file objectâ\u0080\u0099s fileno() method) and build a socket object from the result.  Address\nfamily, socket type and protocol number are as for the socket() function\nabove. The file descriptor should refer to a socket, but this is not checked â\u0080\u0094\nsubsequent operations on the object may fail if the file descriptor is invalid.\nThis function is rarely needed, but can be used to get or set socket options on\na socket passed to a program as standard input or output (such as a server\nstarted by the Unix inet daemon).  The socket is assumed to be in blocking mode. The newly created socket is non-inheritable . Changed in version 3.4: The returned socket is now non-inheritable. socket. fromshare ( data ) Â¶ Instantiate a socket from data obtained from the socket.share() method.  The socket is assumed to be in blocking mode. Availability : Windows. Added in version 3.3. socket. SocketType Â¶ This is a Python type object that represents the socket object type. It is the\nsame as type(socket(...)) . Other functions Â¶ The socket module also offers various network-related services: socket. close ( fd ) Â¶ Close a socket file descriptor. This is like os.close() , but for\nsockets. On some platforms (most noticeable Windows) os.close() does not work for socket file descriptors. Added in version 3.7. socket. getaddrinfo ( host , port , family = AF_UNSPEC , type = 0 , proto = 0 , flags = 0 ) Â¶ This function wraps the C function getaddrinfo of the underlying system. Translate the host / port argument into a sequence of 5-tuples that contain\nall the necessary arguments for creating a socket connected to that service. host is a domain name, a string representation of an IPv4/v6 address\nor None . port is a string service name such as 'http' , a numeric\nport number or None .  By passing None as the value of host and port , you can pass NULL to the underlying C API. The family , type and proto arguments can be optionally specified\nin order to provide options and limit the list of addresses returned.\nPass their default values ( AF_UNSPEC , 0, and 0, respectively)\nto not limit the results. See the note below for details. The flags argument can be one or several of the AI_* constants,\nand will influence how results are computed and returned.\nFor example, AI_NUMERICHOST will disable domain name resolution\nand will raise an error if host is a domain name. The function returns a list of 5-tuples with the following structure: (family, type, proto, canonname, sockaddr) In these tuples, family , type , proto are all integers and are\nmeant to be passed to the socket() function. canonname will be\na string representing the canonical name of the host if AI_CANONNAME is part of the flags argument; else canonname will be empty. sockaddr is a tuple describing a socket address, whose\nformat depends on the returned family (a (address, port) 2-tuple for AF_INET , a (address, port, flowinfo, scope_id) 4-tuple for AF_INET6 ), and is meant to be passed to the socket.connect() method. Note If you intend to use results from getaddrinfo() to create a socket\n(rather than, for example, retrieve canonname ),\nconsider limiting the results by type (e.g. SOCK_STREAM or SOCK_DGRAM ) and/or proto (e.g. IPPROTO_TCP or IPPROTO_UDP ) that your application can handle. The behavior with default values of family , type , proto and flags is system-specific. Many systems (for example, most Linux configurations) will return a sorted\nlist of all matching addresses.\nThese addresses should generally be tried in order until a connection succeeds\n(possibly tried in parallel, for example, using a Happy Eyeballs algorithm).\nIn these cases, limiting the type and/or proto can help eliminate\nunsuccessful or unusable connection attempts. Some systems will, however, only return a single address.\n(For example, this was reported on Solaris and AIX configurations.)\nOn these systems, limiting the type and/or proto helps ensure that\nthis address is usable. Raises an auditing event socket.getaddrinfo with arguments host , port , family , type , protocol . The following example fetches address information for a hypothetical TCP\nconnection to example.org on port 80 (results may differ on your\nsystem if IPv6 isnâ\u0080\u0099t enabled): >>> socket . getaddrinfo ( \"example.org\" , 80 , proto = socket . IPPROTO_TCP ) [(socket.AF_INET6, socket.SOCK_STREAM, 6, '', ('2606:2800:220:1:248:1893:25c8:1946', 80, 0, 0)), (socket.AF_INET, socket.SOCK_STREAM, 6, '', ('93.184.216.34', 80))] Changed in version 3.2: parameters can now be passed using keyword arguments. Changed in version 3.7: for IPv6 multicast addresses, string representing an address will not\ncontain %scope_id part. socket. getfqdn ( [ name ] ) Â¶ Return a fully qualified domain name for name . If name is omitted or empty,\nit is interpreted as the local host.  To find the fully qualified name, the\nhostname returned by gethostbyaddr() is checked, followed by aliases for the\nhost, if available.  The first name which includes a period is selected.  In\ncase no fully qualified domain name is available and name was provided,\nit is returned unchanged.  If name was empty or equal to '0.0.0.0' ,\nthe hostname from gethostname() is returned. socket. gethostbyname ( hostname ) Â¶ Translate a host name to IPv4 address format.  The IPv4 address is returned as a\nstring, such as '100.50.200.5' .  If the host name is an IPv4 address itself\nit is returned unchanged.  See gethostbyname_ex() for a more complete\ninterface. gethostbyname() does not support IPv6 name resolution, and getaddrinfo() should be used instead for IPv4/v6 dual stack support. Raises an auditing event socket.gethostbyname with argument hostname . Availability : not WASI. socket. gethostbyname_ex ( hostname ) Â¶ Translate a host name to IPv4 address format, extended interface. Return a\n3-tuple (hostname, aliaslist, ipaddrlist) where hostname is the hostâ\u0080\u0099s\nprimary host name, aliaslist is a (possibly\nempty) list of alternative host names for the same address, and ipaddrlist is\na list of IPv4 addresses for the same interface on the same host (often but not\nalways a single address). gethostbyname_ex() does not support IPv6 name\nresolution, and getaddrinfo() should be used instead for IPv4/v6 dual\nstack support. Raises an auditing event socket.gethostbyname with argument hostname . Availability : not WASI. socket. gethostname ( ) Â¶ Return a string containing the hostname of the machine where  the Python\ninterpreter is currently executing. Raises an auditing event socket.gethostname with no arguments. Note: gethostname() doesnâ\u0080\u0099t always return the fully qualified domain\nname; use getfqdn() for that. Availability : not WASI. socket. gethostbyaddr ( ip_address ) Â¶ Return a 3-tuple (hostname, aliaslist, ipaddrlist) where hostname is the\nprimary host name responding to the given ip_address , aliaslist is a\n(possibly empty) list of alternative host names for the same address, and ipaddrlist is a list of IPv4/v6 addresses for the same interface on the same\nhost (most likely containing only a single address). To find the fully qualified\ndomain name, use the function getfqdn() . gethostbyaddr() supports\nboth IPv4 and IPv6. Raises an auditing event socket.gethostbyaddr with argument ip_address . Availability : not WASI. socket. getnameinfo ( sockaddr , flags ) Â¶ Translate a socket address sockaddr into a 2-tuple (host, port) . Depending\non the settings of flags , the result can contain a fully qualified domain name\nor numeric address representation in host .  Similarly, port can contain a\nstring port name or a numeric port number. For IPv6 addresses, %scope_id is appended to the host part if sockaddr contains meaningful scope_id . Usually this happens for multicast addresses. For more information about flags you can consult getnameinfo(3) . Raises an auditing event socket.getnameinfo with argument sockaddr . Availability : not WASI. socket. getprotobyname ( protocolname ) Â¶ Translate an internet protocol name (for example, 'icmp' ) to a constant\nsuitable for passing as the (optional) third argument to the socket() function.  This is usually only needed for sockets opened in â\u0080\u009crawâ\u0080\u009d mode\n( SOCK_RAW ); for the normal socket modes, the correct protocol is chosen\nautomatically if the protocol is omitted or zero. Availability : not WASI. socket. getservbyname ( servicename [ , protocolname ] ) Â¶ Translate an internet service name and protocol name to a port number for that\nservice.  The optional protocol name, if given, should be 'tcp' or 'udp' , otherwise any protocol will match. Raises an auditing event socket.getservbyname with arguments servicename , protocolname . Availability : not WASI. socket. getservbyport ( port [ , protocolname ] ) Â¶ Translate an internet port number and protocol name to a service name for that\nservice.  The optional protocol name, if given, should be 'tcp' or 'udp' , otherwise any protocol will match. Raises an auditing event socket.getservbyport with arguments port , protocolname . Availability : not WASI. socket. ntohl ( x ) Â¶ Convert 32-bit positive integers from network to host byte order.  On machines\nwhere the host byte order is the same as network byte order, this is a no-op;\notherwise, it performs a 4-byte swap operation. socket. ntohs ( x ) Â¶ Convert 16-bit positive integers from network to host byte order.  On machines\nwhere the host byte order is the same as network byte order, this is a no-op;\notherwise, it performs a 2-byte swap operation. Changed in version 3.10: Raises OverflowError if x does not fit in a 16-bit unsigned\ninteger. socket. htonl ( x ) Â¶ Convert 32-bit positive integers from host to network byte order.  On machines\nwhere the host byte order is the same as network byte order, this is a no-op;\notherwise, it performs a 4-byte swap operation. socket. htons ( x ) Â¶ Convert 16-bit positive integers from host to network byte order.  On machines\nwhere the host byte order is the same as network byte order, this is a no-op;\notherwise, it performs a 2-byte swap operation. Changed in version 3.10: Raises OverflowError if x does not fit in a 16-bit unsigned\ninteger. socket. inet_aton ( ip_string ) Â¶ Convert an IPv4 address from dotted-quad string format (for example,\nâ\u0080\u0098123.45.67.89â\u0080\u0099) to 32-bit packed binary format, as a bytes object four characters in\nlength.  This is useful when conversing with a program that uses the standard C\nlibrary and needs objects of type in_addr , which is the C type\nfor the 32-bit packed binary this function returns. inet_aton() also accepts strings with less than three dots; see the\nUnix manual page inet(3) for details. If the IPv4 address string passed to this function is invalid, OSError will be raised. Note that exactly what is valid depends on\nthe underlying C implementation of inet_aton() . inet_aton() does not support IPv6, and inet_pton() should be used\ninstead for IPv4/v6 dual stack support. socket. inet_ntoa ( packed_ip ) Â¶ Convert a 32-bit packed IPv4 address (a bytes-like object four\nbytes in length) to its standard dotted-quad string representation (for example,\nâ\u0080\u0098123.45.67.89â\u0080\u0099).  This is useful when conversing with a program that uses the\nstandard C library and needs objects of type in_addr , which\nis the C type for the 32-bit packed binary data this function takes as an\nargument. If the byte sequence passed to this function is not exactly 4 bytes in\nlength, OSError will be raised. inet_ntoa() does not\nsupport IPv6, and inet_ntop() should be used instead for IPv4/v6 dual\nstack support. Changed in version 3.5: Writable bytes-like object is now accepted. socket. inet_pton ( address_family , ip_string ) Â¶ Convert an IP address from its family-specific string format to a packed,\nbinary format. inet_pton() is useful when a library or network protocol\ncalls for an object of type in_addr (similar to inet_aton() ) or in6_addr . Supported values for address_family are currently AF_INET and AF_INET6 . If the IP address string ip_string is invalid, OSError will be raised. Note that exactly what is valid depends on\nboth the value of address_family and the underlying implementation of inet_pton() . Availability : Unix, Windows. Changed in version 3.4: Windows support added socket. inet_ntop ( address_family , packed_ip ) Â¶ Convert a packed IP address (a bytes-like object of some number of\nbytes) to its standard, family-specific string representation (for\nexample, '7.10.0.5' or '5aef:2b::8' ). inet_ntop() is useful when a library or network protocol returns an\nobject of type in_addr (similar to inet_ntoa() ) or in6_addr . Supported values for address_family are currently AF_INET and AF_INET6 . If the bytes object packed_ip is not the correct\nlength for the specified address family, ValueError will be raised. OSError is raised for errors from the call to inet_ntop() . Availability : Unix, Windows. Changed in version 3.4: Windows support added Changed in version 3.5: Writable bytes-like object is now accepted. socket. CMSG_LEN ( length ) Â¶ Return the total length, without trailing padding, of an ancillary\ndata item with associated data of the given length .  This value\ncan often be used as the buffer size for recvmsg() to\nreceive a single item of ancillary data, but RFC 3542 requires\nportable applications to use CMSG_SPACE() and thus include\nspace for padding, even when the item will be the last in the\nbuffer.  Raises OverflowError if length is outside the\npermissible range of values. Availability : Unix, not WASI. Most Unix platforms. Added in version 3.3. socket. CMSG_SPACE ( length ) Â¶ Return the buffer size needed for recvmsg() to\nreceive an ancillary data item with associated data of the given length , along with any trailing padding.  The buffer space needed\nto receive multiple items is the sum of the CMSG_SPACE() values for their associated data lengths.  Raises OverflowError if length is outside the permissible range\nof values. Note that some systems might support ancillary data without\nproviding this function.  Also note that setting the buffer size\nusing the results of this function may not precisely limit the\namount of ancillary data that can be received, since additional\ndata may be able to fit into the padding area. Availability : Unix, not WASI. most Unix platforms. Added in version 3.3. socket. getdefaulttimeout ( ) Â¶ Return the default timeout in seconds (float) for new socket objects. A value\nof None indicates that new socket objects have no timeout. When the socket\nmodule is first imported, the default is None . socket. setdefaulttimeout ( timeout ) Â¶ Set the default timeout in seconds (float) for new socket objects.  When\nthe socket module is first imported, the default is None .  See settimeout() for possible values and their respective\nmeanings. socket. sethostname ( name ) Â¶ Set the machineâ\u0080\u0099s hostname to name .  This will raise an OSError if you donâ\u0080\u0099t have enough rights. Raises an auditing event socket.sethostname with argument name . Availability : Unix, not Android. Added in version 3.3. socket. if_nameindex ( ) Â¶ Return a list of network interface information\n(index int, name string) tuples. OSError if the system call fails. Availability : Unix, Windows, not WASI. Added in version 3.3. Changed in version 3.8: Windows support was added. Note On Windows network interfaces have different names in different contexts\n(all names are examples): UUID: {FB605B73-AAC2-49A6-9A2F-25416AEA0573} name: ethernet_32770 friendly name: vEthernet (nat) description: Hyper-V Virtual Ethernet Adapter This function returns names of the second form from the list, ethernet_32770 in this example case. socket. if_nametoindex ( if_name ) Â¶ Return a network interface index number corresponding to an\ninterface name. OSError if no interface with the given name exists. Availability : Unix, Windows, not WASI. Added in version 3.3. Changed in version 3.8: Windows support was added. See also â\u0080\u009cInterface nameâ\u0080\u009d is a name as documented in if_nameindex() . socket. if_indextoname ( if_index ) Â¶ Return a network interface name corresponding to an\ninterface index number. OSError if no interface with the given index exists. Availability : Unix, Windows, not WASI. Added in version 3.3. Changed in version 3.8: Windows support was added. See also â\u0080\u009cInterface nameâ\u0080\u009d is a name as documented in if_nameindex() . socket. send_fds ( sock , buffers , fds [ , flags [ , address ] ] ) Â¶ Send the list of file descriptors fds over an AF_UNIX socket sock .\nThe fds parameter is a sequence of file descriptors.\nConsult sendmsg() for the documentation of these parameters. Availability : Unix, not WASI. Unix platforms supporting sendmsg() and SCM_RIGHTS mechanism. Added in version 3.9. socket. recv_fds ( sock , bufsize , maxfds [ , flags ] ) Â¶ Receive up to maxfds file descriptors from an AF_UNIX socket sock .\nReturn (msg, list(fds), flags, addr) .\nConsult recvmsg() for the documentation of these parameters. Availability : Unix, not WASI. Unix platforms supporting recvmsg() and SCM_RIGHTS mechanism. Added in version 3.9. Note Any truncated integers at the end of the list of file descriptors. Socket Objects Â¶ Socket objects have the following methods.  Except for makefile() , these correspond to Unix system calls applicable\nto sockets. Changed in version 3.2: Support for the context manager protocol was added.  Exiting the\ncontext manager is equivalent to calling close() . socket. accept ( ) Â¶ Accept a connection. The socket must be bound to an address and listening for\nconnections. The return value is a pair (conn, address) where conn is a new socket object usable to send and receive data on the connection, and address is the address bound to the socket on the other end of the connection. The newly created socket is non-inheritable . Changed in version 3.4: The socket is now non-inheritable. Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. bind ( address ) Â¶ Bind the socket to address .  The socket must not already be bound. (The format\nof address depends on the address family â\u0080\u0094 see above.) Raises an auditing event socket.bind with arguments self , address . Availability : not WASI. socket. close ( ) Â¶ Mark the socket closed.  The underlying system resource (e.g. a file\ndescriptor) is also closed when all file objects from makefile() are closed.  Once that happens, all future operations on the socket\nobject will fail. The remote end will receive no more data (after\nqueued data is flushed). Sockets are automatically closed when they are garbage-collected, but\nit is recommended to close() them explicitly, or to use a with statement around them. Changed in version 3.6: OSError is now raised if an error occurs when the underlying close() call is made. Note close() releases the resource associated with a connection but\ndoes not necessarily close the connection immediately.  If you want\nto close the connection in a timely fashion, call shutdown() before close() . socket. connect ( address ) Â¶ Connect to a remote socket at address . (The format of address depends on the\naddress family â\u0080\u0094 see above.) If the connection is interrupted by a signal, the method waits until the\nconnection completes, or raise a TimeoutError on timeout, if the\nsignal handler doesnâ\u0080\u0099t raise an exception and the socket is blocking or has\na timeout. For non-blocking sockets, the method raises an InterruptedError exception if the connection is interrupted by a\nsignal (or the exception raised by the signal handler). Raises an auditing event socket.connect with arguments self , address . Changed in version 3.5: The method now waits until the connection completes instead of raising an InterruptedError exception if the connection is interrupted by a\nsignal, the signal handler doesnâ\u0080\u0099t raise an exception and the socket is\nblocking or has a timeout (see the PEP 475 for the rationale). Availability : not WASI. socket. connect_ex ( address ) Â¶ Like connect(address) , but return an error indicator instead of raising an\nexception for errors returned by the C-level connect() call (other\nproblems, such as â\u0080\u009chost not found,â\u0080\u009d can still raise exceptions).  The error\nindicator is 0 if the operation succeeded, otherwise the value of the errno variable.  This is useful to support, for example, asynchronous\nconnects. Raises an auditing event socket.connect with arguments self , address . Availability : not WASI. socket. detach ( ) Â¶ Put the socket object into closed state without actually closing the\nunderlying file descriptor.  The file descriptor is returned, and can\nbe reused for other purposes. Added in version 3.2. socket. dup ( ) Â¶ Duplicate the socket. The newly created socket is non-inheritable . Changed in version 3.4: The socket is now non-inheritable. Availability : not WASI. socket. fileno ( ) Â¶ Return the socketâ\u0080\u0099s file descriptor (a small integer), or -1 on failure. This\nis useful with select.select() . Under Windows the small integer returned by this method cannot be used where a\nfile descriptor can be used (such as os.fdopen() ).  Unix does not have\nthis limitation. socket. get_inheritable ( ) Â¶ Get the inheritable flag of the socketâ\u0080\u0099s file\ndescriptor or socketâ\u0080\u0099s handle: True if the socket can be inherited in\nchild processes, False if it cannot. Added in version 3.4. socket. getpeername ( ) Â¶ Return the remote address to which the socket is connected.  This is useful to\nfind out the port number of a remote IPv4/v6 socket, for instance. (The format\nof the address returned depends on the address family â\u0080\u0094 see above.)  On some\nsystems this function is not supported. socket. getsockname ( ) Â¶ Return the socketâ\u0080\u0099s own address.  This is useful to find out the port number of\nan IPv4/v6 socket, for instance. (The format of the address returned depends on\nthe address family â\u0080\u0094 see above.) socket. getsockopt ( level , optname [ , buflen ] ) Â¶ Return the value of the given socket option (see the Unix man page getsockopt(2) ).  The needed symbolic constants ( SO_* etc. )\nare defined in this module.  If buflen is absent, an integer option is assumed\nand its integer value is returned by the function.  If buflen is present, it\nspecifies the maximum length of the buffer used to receive the option in, and\nthis buffer is returned as a bytes object.  It is up to the caller to decode the\ncontents of the buffer (see the optional built-in module struct for a way\nto decode C structures encoded as byte strings). Availability : not WASI. socket. getblocking ( ) Â¶ Return True if socket is in blocking mode, False if in\nnon-blocking. This is equivalent to checking socket.gettimeout() != 0 . Added in version 3.7. socket. gettimeout ( ) Â¶ Return the timeout in seconds (float) associated with socket operations,\nor None if no timeout is set.  This reflects the last call to setblocking() or settimeout() . socket. ioctl ( control , option ) Â¶ Platform : Windows The ioctl() method is a limited interface to the WSAIoctl system\ninterface.  Please refer to the Win32 documentation for more\ninformation. On other platforms, the generic fcntl.fcntl() and fcntl.ioctl() functions may be used; they accept a socket object as their first argument. Currently only the following control codes are supported: SIO_RCVALL , SIO_KEEPALIVE_VALS , and SIO_LOOPBACK_FAST_PATH . Changed in version 3.6: SIO_LOOPBACK_FAST_PATH was added. socket. listen ( [ backlog ] ) Â¶ Enable a server to accept connections.  If backlog is specified, it must\nbe at least 0 (if it is lower, it is set to 0); it specifies the number of\nunaccepted connections that the system will allow before refusing new\nconnections. If not specified, a default reasonable value is chosen. Availability : not WASI. Changed in version 3.5: The backlog parameter is now optional. socket. makefile ( mode = 'r' , buffering = None , * , encoding = None , errors = None , newline = None ) Â¶ Return a file object associated with the socket.  The exact returned\ntype depends on the arguments given to makefile() .  These arguments are\ninterpreted the same way as by the built-in open() function, except\nthe only supported mode values are 'r' (default), 'w' , 'b' , or\na combination of those. The socket must be in blocking mode; it can have a timeout, but the file\nobjectâ\u0080\u0099s internal buffer may end up in an inconsistent state if a timeout\noccurs. Closing the file object returned by makefile() wonâ\u0080\u0099t close the\noriginal socket unless all other file objects have been closed and socket.close() has been called on the socket object. Note On Windows, the file-like object created by makefile() cannot be\nused where a file object with a file descriptor is expected, such as the\nstream arguments of subprocess.Popen() . socket. recv ( bufsize [ , flags ] ) Â¶ Receive data from the socket.  The return value is a bytes object representing the\ndata received.  The maximum amount of data to be received at once is specified\nby bufsize . A returned empty bytes object indicates that the client has disconnected.\nSee the Unix manual page recv(2) for the meaning of the optional argument flags ; it defaults to zero. Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. recvfrom ( bufsize [ , flags ] ) Â¶ Receive data from the socket.  The return value is a pair (bytes, address) where bytes is a bytes object representing the data received and address is the\naddress of the socket sending the data.  See the Unix manual page recv(2) for the meaning of the optional argument flags ; it defaults\nto zero. (The format of address depends on the address family â\u0080\u0094 see above.) Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). Changed in version 3.7: For multicast IPv6 address, first item of address does not contain %scope_id part anymore. In order to get full IPv6 address use getnameinfo() . socket. recvmsg ( bufsize [ , ancbufsize [ , flags ] ] ) Â¶ Receive normal data (up to bufsize bytes) and ancillary data from\nthe socket.  The ancbufsize argument sets the size in bytes of\nthe internal buffer used to receive the ancillary data; it defaults\nto 0, meaning that no ancillary data will be received.  Appropriate\nbuffer sizes for ancillary data can be calculated using CMSG_SPACE() or CMSG_LEN() , and items which do not fit\ninto the buffer might be truncated or discarded.  The flags argument defaults to 0 and has the same meaning as for recv() . The return value is a 4-tuple: (data, ancdata, msg_flags, address) .  The data item is a bytes object holding the\nnon-ancillary data received.  The ancdata item is a list of zero\nor more tuples (cmsg_level, cmsg_type, cmsg_data) representing\nthe ancillary data (control messages) received: cmsg_level and cmsg_type are integers specifying the protocol level and\nprotocol-specific type respectively, and cmsg_data is a bytes object holding the associated data.  The msg_flags item is the bitwise OR of various flags indicating conditions on\nthe received message; see your system documentation for details.\nIf the receiving socket is unconnected, address is the address of\nthe sending socket, if available; otherwise, its value is\nunspecified. On some systems, sendmsg() and recvmsg() can be used to\npass file descriptors between processes over an AF_UNIX socket.  When this facility is used (it is often restricted to SOCK_STREAM sockets), recvmsg() will return, in its\nancillary data, items of the form (socket.SOL_SOCKET, socket.SCM_RIGHTS, fds) , where fds is a bytes object\nrepresenting the new file descriptors as a binary array of the\nnative C int type.  If recvmsg() raises an\nexception after the system call returns, it will first attempt to\nclose any file descriptors received via this mechanism. Some systems do not indicate the truncated length of ancillary data\nitems which have been only partially received.  If an item appears\nto extend beyond the end of the buffer, recvmsg() will issue\na RuntimeWarning , and will return the part of it which is\ninside the buffer provided it has not been truncated before the\nstart of its associated data. On systems which support the SCM_RIGHTS mechanism, the\nfollowing function will receive up to maxfds file descriptors,\nreturning the message data and a list containing the descriptors\n(while ignoring unexpected conditions such as unrelated control\nmessages being received).  See also sendmsg() . import socket , array def recv_fds ( sock , msglen , maxfds ): fds = array . array ( \"i\" ) # Array of ints msg , ancdata , flags , addr = sock . recvmsg ( msglen , socket . CMSG_LEN ( maxfds * fds . itemsize )) for cmsg_level , cmsg_type , cmsg_data in ancdata : if cmsg_level == socket . SOL_SOCKET and cmsg_type == socket . SCM_RIGHTS : # Append data, ignoring any truncated integers at the end. fds . frombytes ( cmsg_data [: len ( cmsg_data ) - ( len ( cmsg_data ) % fds . itemsize )]) return msg , list ( fds ) Availability : Unix. Most Unix platforms. Added in version 3.3. Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. recvmsg_into ( buffers [ , ancbufsize [ , flags ] ] ) Â¶ Receive normal data and ancillary data from the socket, behaving as recvmsg() would, but scatter the non-ancillary data into a\nseries of buffers instead of returning a new bytes object.  The buffers argument must be an iterable of objects that export\nwritable buffers (e.g. bytearray objects); these will be\nfilled with successive chunks of the non-ancillary data until it\nhas all been written or there are no more buffers.  The operating\nsystem may set a limit ( sysconf() value SC_IOV_MAX )\non the number of buffers that can be used.  The ancbufsize and flags arguments have the same meaning as for recvmsg() . The return value is a 4-tuple: (nbytes, ancdata, msg_flags, address) , where nbytes is the total number of bytes of\nnon-ancillary data written into the buffers, and ancdata , msg_flags and address are the same as for recvmsg() . Example: >>> import socket >>> s1 , s2 = socket . socketpair () >>> b1 = bytearray ( b '----' ) >>> b2 = bytearray ( b '0123456789' ) >>> b3 = bytearray ( b '--------------' ) >>> s1 . send ( b 'Mary had a little lamb' ) 22 >>> s2 . recvmsg_into ([ b1 , memoryview ( b2 )[ 2 : 9 ], b3 ]) (22, [], 0, None) >>> [ b1 , b2 , b3 ] [bytearray(b'Mary'), bytearray(b'01 had a 9'), bytearray(b'little lamb---')] Availability : Unix. Most Unix platforms. Added in version 3.3. socket. recvfrom_into ( buffer [ , nbytes [ , flags ] ] ) Â¶ Receive data from the socket, writing it into buffer instead of creating a\nnew bytestring.  The return value is a pair (nbytes, address) where nbytes is\nthe number of bytes received and address is the address of the socket sending\nthe data.  See the Unix manual page recv(2) for the meaning of the\noptional argument flags ; it defaults to zero.  (The format of address depends on the address family â\u0080\u0094 see above.) socket. recv_into ( buffer [ , nbytes [ , flags ] ] ) Â¶ Receive up to nbytes bytes from the socket, storing the data into a buffer\nrather than creating a new bytestring.  If nbytes is not specified (or 0),\nreceive up to the size available in the given buffer.  Returns the number of\nbytes received.  See the Unix manual page recv(2) for the meaning\nof the optional argument flags ; it defaults to zero. socket. send ( bytes [ , flags ] ) Â¶ Send data to the socket.  The socket must be connected to a remote socket.  The\noptional flags argument has the same meaning as for recv() above.\nReturns the number of bytes sent. Applications are responsible for checking that\nall data has been sent; if only some of the data was transmitted, the\napplication needs to attempt delivery of the remaining data. For further\ninformation on this topic, consult the Socket Programming HOWTO . Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. sendall ( bytes [ , flags ] ) Â¶ Send data to the socket.  The socket must be connected to a remote socket.  The\noptional flags argument has the same meaning as for recv() above.\nUnlike send() , this method continues to send data from bytes until\neither all data has been sent or an error occurs. None is returned on\nsuccess.  On error, an exception is raised, and there is no way to determine how\nmuch data, if any, was successfully sent. Changed in version 3.5: The socket timeout is no longer reset each time data is sent successfully.\nThe socket timeout is now the maximum total duration to send all data. Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. sendto ( bytes , address ) Â¶ socket. sendto ( bytes , flags , address ) Send data to the socket.  The socket should not be connected to a remote socket,\nsince the destination socket is specified by address .  The optional flags argument has the same meaning as for recv() above.  Return the number of\nbytes sent. (The format of address depends on the address family â\u0080\u0094 see\nabove.) Raises an auditing event socket.sendto with arguments self , address . Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. sendmsg ( buffers [ , ancdata [ , flags [ , address ] ] ] ) Â¶ Send normal and ancillary data to the socket, gathering the\nnon-ancillary data from a series of buffers and concatenating it\ninto a single message.  The buffers argument specifies the\nnon-ancillary data as an iterable of bytes-like objects (e.g. bytes objects); the operating system may set a limit\n( sysconf() value SC_IOV_MAX ) on the number of buffers\nthat can be used.  The ancdata argument specifies the ancillary\ndata (control messages) as an iterable of zero or more tuples (cmsg_level, cmsg_type, cmsg_data) , where cmsg_level and cmsg_type are integers specifying the protocol level and\nprotocol-specific type respectively, and cmsg_data is a\nbytes-like object holding the associated data.  Note that\nsome systems (in particular, systems without CMSG_SPACE() )\nmight support sending only one control message per call.  The flags argument defaults to 0 and has the same meaning as for send() .  If address is supplied and not None , it sets a\ndestination address for the message.  The return value is the\nnumber of bytes of non-ancillary data sent. The following function sends the list of file descriptors fds over an AF_UNIX socket, on systems which support the SCM_RIGHTS mechanism.  See also recvmsg() . import socket , array def send_fds ( sock , msg , fds ): return sock . sendmsg ([ msg ], [( socket . SOL_SOCKET , socket . SCM_RIGHTS , array . array ( \"i\" , fds ))]) Availability : Unix, not WASI. Most Unix platforms. Raises an auditing event socket.sendmsg with arguments self , address . Added in version 3.3. Changed in version 3.5: If the system call is interrupted and the signal handler does not raise\nan exception, the method now retries the system call instead of raising\nan InterruptedError exception (see PEP 475 for the rationale). socket. sendmsg_afalg ( [ msg , ] * , op [ , iv [ , assoclen [ , flags ] ] ] ) Â¶ Specialized version of sendmsg() for AF_ALG socket.\nSet mode, IV, AEAD associated data length and flags for AF_ALG socket. Availability : Linux >= 2.6.38. Added in version 3.6. socket. sendfile ( file , offset = 0 , count = None ) Â¶ Send a file until EOF is reached by using high-performance os.sendfile and return the total number of bytes which were sent. file must be a regular file object opened in binary mode. If os.sendfile is not available (e.g. Windows) or file is not a\nregular file send() will be used instead. offset tells from where to\nstart reading the file. If specified, count is the total number of bytes\nto transmit as opposed to sending the file until EOF is reached. File\nposition is updated on return or also in case of error in which case file.tell() can be used to figure out the number of\nbytes which were sent. The socket must be of SOCK_STREAM type.\nNon-blocking sockets are not supported. Added in version 3.5. socket. set_inheritable ( inheritable ) Â¶ Set the inheritable flag of the socketâ\u0080\u0099s file\ndescriptor or socketâ\u0080\u0099s handle. Added in version 3.4. socket. setblocking ( flag ) Â¶ Set blocking or non-blocking mode of the socket: if flag is false, the\nsocket is set to non-blocking, else to blocking mode. This method is a shorthand for certain settimeout() calls: sock.setblocking(True) is equivalent to sock.settimeout(None) sock.setblocking(False) is equivalent to sock.settimeout(0.0) Changed in version 3.7: The method no longer applies SOCK_NONBLOCK flag on socket.type . socket. settimeout ( value ) Â¶ Set a timeout on blocking socket operations.  The value argument can be a\nnonnegative floating-point number expressing seconds, or None .\nIf a non-zero value is given, subsequent socket operations will raise a timeout exception if the timeout period value has elapsed before\nthe operation has completed.  If zero is given, the socket is put in\nnon-blocking mode. If None is given, the socket is put in blocking mode. For further information, please consult the notes on socket timeouts . Changed in version 3.7: The method no longer toggles SOCK_NONBLOCK flag on socket.type . socket. setsockopt ( level , optname , value : int ) Â¶ socket. setsockopt ( level , optname , value : buffer ) socket. setsockopt ( level , optname , None , optlen: int ) Set the value of the given socket option (see the Unix manual page setsockopt(2) ).  The needed symbolic constants are defined in this\nmodule ( SO_* etc. <socket-unix-constants> ).  The value can be an integer, None or a bytes-like object representing a buffer. In the later\ncase it is up to the caller to ensure that the bytestring contains the\nproper bits (see the optional built-in module struct for a way to\nencode C structures as bytestrings). When value is set to None , optlen argument is required. Itâ\u0080\u0099s equivalent to call setsockopt() C\nfunction with optval=NULL and optlen=optlen . Changed in version 3.5: Writable bytes-like object is now accepted. Changed in version 3.6: setsockopt(level, optname, None, optlen: int) form added. Availability : not WASI. socket. shutdown ( how ) Â¶ Shut down one or both halves of the connection.  If how is SHUT_RD ,\nfurther receives are disallowed.  If how is SHUT_WR , further sends\nare disallowed.  If how is SHUT_RDWR , further sends and receives are\ndisallowed. Availability : not WASI. socket. share ( process_id ) Â¶ Duplicate a socket and prepare it for sharing with a target process.  The\ntarget process must be provided with process_id .  The resulting bytes object\ncan then be passed to the target process using some form of interprocess\ncommunication and the socket can be recreated there using fromshare() .\nOnce this method has been called, it is safe to close the socket since\nthe operating system has already duplicated it for the target process. Availability : Windows. Added in version 3.3. Note that there are no methods read() or write() ; use recv() and send() without flags argument instead. Socket objects also have these (read-only) attributes that correspond to the\nvalues given to the socket constructor. socket. family Â¶ The socket family. socket. type Â¶ The socket type. socket. proto Â¶ The socket protocol. Notes on socket timeouts Â¶ A socket object can be in one of three modes: blocking, non-blocking, or\ntimeout.  Sockets are by default always created in blocking mode, but this\ncan be changed by calling setdefaulttimeout() . In blocking mode , operations block until complete or the system returns\nan error (such as connection timed out). In non-blocking mode , operations fail (with an error that is unfortunately\nsystem-dependent) if they cannot be completed immediately: functions from the select module can be used to know when and whether a socket is available\nfor reading or writing. In timeout mode , operations fail if they cannot be completed within the\ntimeout specified for the socket (they raise a timeout exception)\nor if the system returns an error. Note At the operating system level, sockets in timeout mode are internally set\nin non-blocking mode.  Also, the blocking and timeout modes are shared between\nfile descriptors and socket objects that refer to the same network endpoint.\nThis implementation detail can have visible consequences if e.g. you decide\nto use the fileno() of a socket. Timeouts and the connect method Â¶ The connect() operation is also subject to the timeout\nsetting, and in general it is recommended to call settimeout() before calling connect() or pass a timeout parameter to create_connection() .  However, the system network stack may also\nreturn a connection timeout error of its own regardless of any Python socket\ntimeout setting. Timeouts and the accept method Â¶ If getdefaulttimeout() is not None , sockets returned by\nthe accept() method inherit that timeout.  Otherwise, the\nbehaviour depends on settings of the listening socket: if the listening socket is in blocking mode or in timeout mode ,\nthe socket returned by accept() is in blocking mode ; if the listening socket is in non-blocking mode , whether the socket\nreturned by accept() is in blocking or non-blocking mode\nis operating system-dependent.  If you want to ensure cross-platform\nbehaviour, it is recommended you manually override this setting. Example Â¶ Here are four minimal example programs using the TCP/IP protocol: a server that\nechoes all data that it receives back (servicing only one client), and a client\nusing it.  Note that a server must perform the sequence socket() , bind() , listen() , accept() (possibly\nrepeating the accept() to service more than one client), while a\nclient only needs the sequence socket() , connect() .  Also\nnote that the server does not sendall() / recv() on\nthe socket it is listening on but on the new socket returned by accept() . The first two examples support IPv4 only. # Echo server program import socket HOST = '' # Symbolic name meaning all available interfaces PORT = 50007 # Arbitrary non-privileged port with socket . socket ( socket . AF_INET , socket . SOCK_STREAM ) as s : s . bind (( HOST , PORT )) s . listen ( 1 ) conn , addr = s . accept () with conn : print ( 'Connected by' , addr ) while True : data = conn . recv ( 1024 ) if not data : break conn . sendall ( data ) # Echo client program import socket HOST = 'daring.cwi.nl' # The remote host PORT = 50007 # The same port as used by the server with socket . socket ( socket . AF_INET , socket . SOCK_STREAM ) as s : s . connect (( HOST , PORT )) s . sendall ( b 'Hello, world' ) data = s . recv ( 1024 ) print ( 'Received' , repr ( data )) The next two examples are identical to the above two, but support both IPv4 and\nIPv6. The server side will listen to the first address family available (it\nshould listen to both instead). On most of IPv6-ready systems, IPv6 will take\nprecedence and the server may not accept IPv4 traffic. The client side will try\nto connect to all the addresses returned as a result of the name resolution, and\nsends traffic to the first one connected successfully. # Echo server program import socket import sys HOST = None # Symbolic name meaning all available interfaces PORT = 50007 # Arbitrary non-privileged port s = None for res in socket . getaddrinfo ( HOST , PORT , socket . AF_UNSPEC , socket . SOCK_STREAM , 0 , socket . AI_PASSIVE ): af , socktype , proto , canonname , sa = res try : s = socket . socket ( af , socktype , proto ) except OSError as msg : s = None continue try : s . bind ( sa ) s . listen ( 1 ) except OSError as msg : s . close () s = None continue break if s is None : print ( 'could not open socket' ) sys . exit ( 1 ) conn , addr = s . accept () with conn : print ( 'Connected by' , addr ) while True : data = conn . recv ( 1024 ) if not data : break conn . send ( data ) # Echo client program import socket import sys HOST = 'daring.cwi.nl' # The remote host PORT = 50007 # The same port as used by the server s = None for res in socket . getaddrinfo ( HOST , PORT , socket . AF_UNSPEC , socket . SOCK_STREAM ): af , socktype , proto , canonname , sa = res try : s = socket . socket ( af , socktype , proto ) except OSError as msg : s = None continue try : s . connect ( sa ) except OSError as msg : s . close () s = None continue break if s is None : print ( 'could not open socket' ) sys . exit ( 1 ) with s : s . sendall ( b 'Hello, world' ) data = s . recv ( 1024 ) print ( 'Received' , repr ( data )) The next example shows how to write a very simple network sniffer with raw\nsockets on Windows. The example requires administrator privileges to modify\nthe interface: import socket # the public network interface HOST = socket . gethostbyname ( socket . gethostname ()) # create a raw socket and bind it to the public interface s = socket . socket ( socket . AF_INET , socket . SOCK_RAW , socket . IPPROTO_IP ) s . bind (( HOST , 0 )) # Include IP headers s . setsockopt ( socket . IPPROTO_IP , socket . IP_HDRINCL , 1 ) # receive all packets s . ioctl ( socket . SIO_RCVALL , socket . RCVALL_ON ) # receive a packet print ( s . recvfrom ( 65565 )) # disabled promiscuous mode s . ioctl ( socket . SIO_RCVALL , socket . RCVALL_OFF ) The next example shows how to use the socket interface to communicate to a CAN\nnetwork using the raw socket protocol. To use CAN with the broadcast\nmanager protocol instead, open a socket with: socket . socket ( socket . AF_CAN , socket . SOCK_DGRAM , socket . CAN_BCM ) After binding ( CAN_RAW ) or connecting ( CAN_BCM ) the socket, you\ncan use the socket.send() and socket.recv() operations (and\ntheir counterparts) on the socket object as usual. This last example might require special privileges: import socket import struct # CAN frame packing/unpacking (see 'struct can_frame' in <linux/can.h>) can_frame_fmt = \"=IB3x8s\" can_frame_size = struct . calcsize ( can_frame_fmt ) def build_can_frame ( can_id , data ): can_dlc = len ( data ) data = data . ljust ( 8 , b ' \\x00 ' ) return struct . pack ( can_frame_fmt , can_id , can_dlc , data ) def dissect_can_frame ( frame ): can_id , can_dlc , data = struct . unpack ( can_frame_fmt , frame ) return ( can_id , can_dlc , data [: can_dlc ]) # create a raw socket and bind it to the 'vcan0' interface s = socket . socket ( socket . AF_CAN , socket . SOCK_RAW , socket . CAN_RAW ) s . bind (( 'vcan0' ,)) while True : cf , addr = s . recvfrom ( can_frame_size ) print ( 'Received: can_id= %x , can_dlc= %x , data= %s ' % dissect_can_frame ( cf )) try : s . send ( cf ) except OSError : print ( 'Error sending CAN frame' ) try : s . send ( build_can_frame ( 0x01 , b ' \\x01\\x02\\x03 ' )) except OSError : print ( 'Error sending CAN frame' ) Running an example several times with too small delay between executions, could\nlead to this error: OSError : [ Errno 98 ] Address already in use This is because the previous execution has left the socket in a TIME_WAIT state, and canâ\u0080\u0099t be immediately reused. There is a socket flag to set, in order to prevent this, socket.SO_REUSEADDR : s = socket . socket ( socket . AF_INET , socket . SOCK_STREAM ) s . setsockopt ( socket . SOL_SOCKET , socket . SO_REUSEADDR , 1 ) s . bind (( HOST , PORT )) the SO_REUSEADDR flag tells the kernel to reuse a local socket in TIME_WAIT state, without waiting for its natural timeout to expire. See also For an introduction to socket programming (in C), see the following papers: An Introductory 4.3BSD Interprocess Communication Tutorial , by Stuart Sechrest An Advanced 4.3BSD Interprocess Communication Tutorial , by Samuel J.  Leffler et\nal, both in the UNIX Programmerâ\u0080\u0099s Manual, Supplementary Documents 1 (sections\nPS1:7 and PS1:8).  The platform-specific reference material for the various\nsocket-related system calls are also a valuable source of information on the\ndetails of socket semantics.  For Unix, refer to the manual pages; for Windows,\nsee the WinSock (or Winsock 2) specification.  For IPv6-ready APIs, readers may\nwant to refer to RFC 3493 titled Basic Socket Interface Extensions for IPv6. Table of Contents socket â\u0080\u0094 Low-level networking interface Socket families Module contents Exceptions Constants Functions Creating sockets Other functions Socket Objects Notes on socket timeouts Timeouts and the connect method Timeouts and the accept method Example Previous topic Developing with asyncio Next topic ssl â\u0080\u0094 TLS/SSL wrapper for socket objects This page Report a bug Show source Â« Navigation index modules | next | previous | Python » 3.13.7 Documentation » The Python Standard Library » Networking and Interprocess Communication » socket â\u0080\u0094 Low-level networking interface | Theme Auto Light Dark | © Copyright 2001-2025, Python Software Foundation. This page is licensed under the Python Software Foundation License Version 2. Examples, recipes, and other code in the documentation are additionally licensed under the Zero Clause BSD License. See History and License for more information. The Python Software Foundation is a non-profit corporation. Please donate. Last updated on Sep 02, 2025 (06:52 UTC). Found a bug ? Created using Sphinx 8.2.3.",
    "Network Working Group                                      R. Fielding\nRequest for Comments: 2616                                   UC Irvine\nObsoletes: 2068                                              J. Gettys\nCategory: Standards Track                                   Compaq/W3C\n                                                              J. Mogul\n                                                                Compaq\n                                                            H. Frystyk\n                                                               W3C/MIT\n                                                           L. Masinter\n                                                                 Xerox\n                                                              P. Leach\n                                                             Microsoft\n                                                        T. Berners-Lee\n                                                               W3C/MIT\n                                                             June 1999 Hypertext Transfer Protocol -- HTTP/1.1 Status of this Memo This document specifies an Internet standards track protocol for the\n   Internet community, and requests discussion and suggestions for\n   improvements.  Please refer to the current edition of the \"Internet\n   Official Protocol Standards\" (STD 1) for the standardization state\n   and status of this protocol.  Distribution of this memo is unlimited. Copyright Notice Copyright (C) The Internet Society (1999).  All Rights Reserved. Abstract The Hypertext Transfer Protocol (HTTP) is an application-level\n   protocol for distributed, collaborative, hypermedia information\n   systems. It is a generic, stateless, protocol which can be used for\n   many tasks beyond its use for hypertext, such as name servers and\n   distributed object management systems, through extension of its\n   request methods, error codes and headers [47] . A feature of HTTP is\n   the typing and negotiation of data representation, allowing systems\n   to be built independently of the data being transferred. HTTP has been in use by the World-Wide Web global information\n   initiative since 1990. This specification defines the protocol\n   referred to as \"HTTP/1.1\", and is an update to RFC 2068 [33] . Table of Contents Introduction ... 1 Purpose ... 1.1 Requirements ... 1.2 Terminology ... 1.3 Overall Operation ... 1.4 Notational Conventions and Generic Grammar ... 2 Augmented BNF ... 2.1 Basic Rules ... 2.2 Protocol Parameters ... 3 HTTP Version ... 3.1 Uniform Resource Identifiers ... 3.2 General Syntax ... 3.2.1 http URL ... 3.2.2 URI Comparison ... 3.2.3 Date/Time Formats ... 3.3 Full Date ... 3.3.1 Delta Seconds ... 3.3.2 Character Sets ... 3.4 Missing Charset ... 3.4.1 Content Codings ... 3.5 Transfer Codings ... 3.6 Chunked Transfer Coding ... 3.6.1 Media Types ... 3.7 Canonicalization and Text Defaults ... 3.7.1 Multipart Types ... 3.7.2 Product Tokens ... 3.8 Quality Values ... 3.9 Language Tags ... 3.10 Entity Tags ... 3.11 Range Units ... 3.12 HTTP Message ... 4 Message Types ... 4.1 Message Headers ... 4.2 Message Body ... 4.3 Message Length ... 4.4 General Header Fields ... 4.5 Request ... 5 Request-Line ... 5.1 Method ... 5.1.1 Request-URI ... 5.1.2 The Resource Identified by a Request ... 5.2 Request Header Fields ... 5.3 Response ... 6 Status-Line ... 6.1 Status Code and Reason Phrase ... 6.1.1 Response Header Fields ... 6.2 Entity ... 7 Entity Header Fields ... 7.1 Entity Body ... 7.2 Type ... 7.2.1 Entity Length ... 7.2.2 Connections ... 8 Persistent Connections ... 8.1 Purpose ... 8.1.1 Overall Operation ... 8.1.2 Proxy Servers ... 8.1.3 Practical Considerations ... 8.1.4 Message Transmission Requirements ... 8.2 Persistent Connections and Flow Control ... 8.2.1 Monitoring Connections for Error Status Messages ... 8.2.2 Use of the 100 (Continue) Status ... 8.2.3 Client Behavior if Server Prematurely Closes Connection ... 8.2.4 Method Definitions ... 9 Safe and Idempotent Methods ... 9.1 Safe Methods ... 9.1.1 Idempotent Methods ... 9.1.2 OPTIONS ... 9.2 GET ... 9.3 HEAD ... 9.4 POST ... 9.5 PUT ... 9.6 DELETE ... 9.7 TRACE ... 9.8 CONNECT ... 9.9 Status Code Definitions ... 10 Informational 1xx ... 10.1 100 Continue ... 10.1.1 101 Switching Protocols ... 10.1.2 Successful 2xx ... 10.2 200 OK ... 10.2.1 201 Created ... 10.2.2 202 Accepted ... 10.2.3 203 Non-Authoritative Information ... 10.2.4 204 No Content ... 10.2.5 205 Reset Content ... 10.2.6 206 Partial Content ... 10.2.7 Redirection 3xx ... 10.3 300 Multiple Choices ... 10.3.1 301 Moved Permanently ... 10.3.2 302 Found ... 10.3.3 303 See Other ... 10.3.4 304 Not Modified ... 10.3.5 305 Use Proxy ... 10.3.6 306 (Unused) ... 10.3.7 307 Temporary Redirect ... 10.3.8 Client Error 4xx ... 10.4 400 Bad Request ... 10.4.1 401 Unauthorized ... 10.4.2 402 Payment Required ... 10.4.3 403 Forbidden ... 10.4.4 404 Not Found ... 10.4.5 405 Method Not Allowed ... 10.4.6 406 Not Acceptable ... 10.4.7 407 Proxy Authentication Required ... 10.4.8 408 Request Timeout ... 10.4.9 409 Conflict ... 10.4.10 410 Gone ... 10.4.11 411 Length Required ... 10.4.12 412 Precondition Failed ... 10.4.13 413 Request Entity Too Large ... 10.4.14 414 Request-URI Too Long ... 10.4.15 415 Unsupported Media Type ... 10.4.16 416 Requested Range Not Satisfiable ... 10.4.17 417 Expectation Failed ... 10.4.18 Server Error 5xx ... 10.5 500 Internal Server Error ... 10.5.1 501 Not Implemented ... 10.5.2 502 Bad Gateway ... 10.5.3 503 Service Unavailable ... 10.5.4 504 Gateway Timeout ... 10.5.5 505 HTTP Version Not Supported ... 10.5.6 Access Authentication ... 11 Content Negotiation ... 12 Server-driven Negotiation ... 12.1 Agent-driven Negotiation ... 12.2 Transparent Negotiation ... 12.3 Caching in HTTP ... 13 @@ missing Cache Correctness ... 13.1.1 Warnings ... 13.1.2 Cache-control Mechanisms ... 13.1.3 Explicit User Agent Warnings ... 13.1.4 Exceptions to the Rules and Warnings ... 13.1.5 Client-controlled Behavior ... 13.1.6 Expiration Model ... 13.2 Server-Specified Expiration ... 13.2.1 Heuristic Expiration ... 13.2.2 Age Calculations ... 13.2.3 Expiration Calculations ... 13.2.4 Disambiguating Expiration Values ... 13.2.5 Disambiguating Multiple Responses ... 13.2.6 Validation Model ... 13.3 Last-Modified Dates ... 13.3.1 Entity Tag Cache Validators ... 13.3.2 Weak and Strong Validators ... 13.3.3 Rules for When to Use Entity Tags and Last-Modified Dates ... 13.3.4 Non-validating Conditionals ... 13.3.5 Response Cacheability ... 13.4 Constructing Responses From Caches ... 13.5 End-to-end and Hop-by-hop Headers ... 13.5.1 Non-modifiable Headers ... 13.5.2 Combining Headers ... 13.5.3 Combining Byte Ranges ... 13.5.4 Caching Negotiated Responses ... 13.6 Shared and Non-Shared Caches ... 13.7 Errors or Incomplete Response Cache Behavior ... 13.8 Side Effects of GET and HEAD ... 13.9 Invalidation After Updates or Deletions ... 13.10 Write-Through Mandatory ... 13.11 Cache Replacement ... 13.12 History Lists ... 13.13 Header Field Definitions ... 14 Accept ... 14.1 Accept-Charset ... 14.2 Accept-Encoding ... 14.3 Accept-Language ... 14.4 Accept-Ranges ... 14.5 Age ... 14.6 Allow ... 14.7 Authorization ... 14.8 Cache-Control ... 14.9 What is Cacheable ... 14.9.1 What May be Stored by Caches ... 14.9.2 Modifications of the Basic Expiration Mechanism ... 14.9.3 Cache Revalidation and Reload Controls ... 14.9.4 No-Transform Directive ... 14.9.5 Cache Control Extensions ... 14.9.6 Connection ... 14.10 Content-Encoding ... 14.11 Content-Language ... 14.12 Content-Length ... 14.13 Content-Location ... 14.14 Content-MD5 ... 14.15 Content-Range ... 14.16 Content-Type ... 14.17 Date ... 14.18 Clockless Origin Server Operation ... 14.18.1 ETag ... 14.19 Expect ... 14.20 Expires ... 14.21 From ... 14.22 Host ... 14.23 If-Match ... 14.24 If-Modified-Since ... 14.25 If-None-Match ... 14.26 If-Range ... 14.27 If-Unmodified-Since ... 14.28 Last-Modified ... 14.29 Location ... 14.30 Max-Forwards ... 14.31 Pragma ... 14.32 Proxy-Authenticate ... 14.33 Proxy-Authorization ... 14.34 Range ... 14.35 Byte Ranges ... 14.35.1 Range Retrieval Requests ... 14.35.2 Referer ... 14.36 Retry-After ... 14.37 Server ... 14.38 TE ... 14.39 Trailer ... 14.40 Transfer-Encoding ... 14.41 Upgrade ... 14.42 User-Agent ... 14.43 Vary ... 14.44 Via ... 14.45 Warning ... 14.46 WWW-Authenticate ... 14.47 Security Considerations ... 15 Personal Information ... 15.1 Abuse of Server Log Information ... 15.1.1 Transfer of Sensitive Information ... 15.1.2 Encoding Sensitive Information in URI's ... 15.1.3 Privacy Issues Connected to Accept Headers ... 15.1.4 Attacks Based On File and Path Names ... 15.2 DNS Spoofing ... 15.3 Location Headers and Spoofing ... 15.4 Content-Disposition Issues ... 15.5 Authentication Credentials and Idle Clients ... 15.6 Proxies and Caching ... 15.7 Denial of Service Attacks on Proxies ... 15.7.1 Acknowledgments ... 16 References ... 17 Authors' Addresses ... 18 Appendices ... 19 Internet Media Type message/http and application/http ... 19.1 Internet Media Type multipart/byteranges ... 19.2 Tolerant Applications ... 19.3 Differences Between HTTP Entities and RFC 2045 Entities ... 19.4 MIME-Version ... 19.4.1 Conversion to Canonical Form ... 19.4.2 Conversion of Date Formats ... 19.4.3 Introduction of Content-Encoding ... 19.4.4 No Content-Transfer-Encoding ... 19.4.5 Introduction of Transfer-Encoding ... 19.4.6 MHTML and Line Length Limitations ... 19.4.7 Additional Features ... 19.5 Content-Disposition ... 19.5.1 Compatibility with Previous Versions ... 19.6 Changes from HTTP/1 ... 19.6.1 Compatibility with HTTP/1 ... 19.6.2 Changes from RFC 2068 ... 19.6.3 Index ... 20 Full Copyright Statement ... 21 derived from HTTP/1.1 , Internet RFC 2616, Fielding, et al. using rfc2html Revision: 1.8  Date: 2004/09/01 13:21:38  by Dan Connolly",
    "What is Cloud Computing? › Cloud Computing Concepts Hub › Application Integration › Networking & Content Delivery What is a RESTful API? Create an AWS Account What is RESTful API? What is an API? What is REST? What are the benefits of RESTful APIs? How do RESTful APIs work? What does the RESTful API client request contain? What are RESTful API authentication methods? What does the RESTful API server response contain? How can AWS help you with RESTful API management? What is RESTful API? RESTful API is an interface that two computer systems use to exchange information securely over the internet. Most business applications have to communicate with other internal and third-party applications to perform various tasks. For example, to generate monthly payslips, your internal accounts system has to share data with your customer's banking system to automate invoicing and communicate with an internal timesheet application. RESTful APIs support this information exchange because they follow secure, reliable, and efficient software communication standards. What is an API? An application programming interface (API) defines the rules that you must follow to communicate with other software systems. Developers expose or create APIs so that other applications can communicate with their applications programmatically. For example, the timesheet application exposes an API that asks for an employee's full name and a range of dates. When it receives this information, it internally processes the employee's timesheet and returns the number of hours worked in that date range. You can think of a web API as a gateway between clients and resources on the web. Clients Clients are users who want to access information from the web. The client can be a person or a software system that uses the API. For example, developers can write programs that access weather data from a weather system. Or you can access the same data from your browser when you visit the weather website directly. Resources Resources are the information that different applications provide to their clients. Resources can be images, videos, text, numbers, or any type of data. The machine that gives the resource to the client is also called the server. Organizations use APIs to share resources and provide web services while maintaining security, control, and authentication. In addition, APIs help them to determine which clients get access to specific internal resources. What is REST? Representational State Transfer (REST) is a software architecture that imposes conditions on how an API should work. REST was initially created as a guideline to manage communication on a complex network like the internet. You can use REST-based architecture to support high-performing and reliable communication at scale. You can easily implement and modify it, bringing visibility and cross-platform portability to any API system. API developers can design APIs using several different architectures. APIs that follow the REST architectural style are called REST APIs. Web services that implement REST architecture are called RESTful web services. The term RESTful API generally refers to RESTful web APIs. However, you can use the terms REST API and RESTful API interchangeably. The following are some of the principles of the REST architectural style: Uniform interface The uniform interface is fundamental to the design of any RESTful webservice. It indicates that the server transfers information in a standard format. The formatted resource is called a representation in REST. This format can be different from the internal representation of the resource on the server application. For example, the server can store data as text but send it in an HTML representation format. Uniform interface imposes four architectural constraints: Requests should identify resources. They do so by using a uniform resource identifier. Clients have enough information in the resource representation to modify or delete the resource if they want to. The server meets this condition by sending metadata that describes the resource further. Clients receive information about how to process the representation further. The server achieves this by sending self-descriptive messages that contain metadata about how the client can best use them. Clients receive information about all other related resources they need to complete a task. The server achieves this by sending hyperlinks in the representation so that clients can dynamically discover more resources. Statelessness In REST architecture, statelessness refers to a communication method in which the server completes every client request independently of all previous requests. Clients can request resources in any order, and every request is stateless or isolated from other requests. This REST API design constraint implies that the server can completely understand and fulfill the request every time. Layered system In a layered system architecture, the client can connect to other authorized intermediaries between the client and server, and it will still receive responses from the server. Servers can also pass on requests to other servers. You can design your RESTful web service to run on several servers with multiple layers such as security, application, and business logic, working together to fulfill client requests. These layers remain invisible to the client. Cacheability RESTful web services support caching, which is the process of storing some responses on the client or on an intermediary to improve server response time. For example, suppose that you visit a website that has common header and footer images on every page. Every time you visit a new website page, the server must resend the same images. To avoid this, the client caches or stores these images after the first response and then uses the images directly from the cache. RESTful web services control caching by using API responses that define themselves as cacheable or noncacheable. Code on demand In REST architectural style, servers can temporarily extend or customize client functionality by transferring software programming code to the client. For example, when you fill a registration form on any website, your browser immediately highlights any mistakes you make, such as incorrect phone numbers. It can do this because of the code sent by the server. What are the benefits of RESTful APIs? RESTful APIs include the following benefits: Scalability Systems that implement REST APIs can scale efficiently because REST optimizes client-server interactions. Statelessness removes server load because the server does not have to retain past client request information. Well-managed caching partially or completely eliminates some client-server interactions. All these features support scalability without causing communication bottlenecks that reduce performance. Flexibility RESTful web services support total client-server separation. They simplify and decouple various server components so that each part can evolve independently. Platform or technology changes at the server application do not affect the client application. The ability to layer application functions increases flexibility even further. For example, developers can make changes to the database layer without rewriting the application logic. Independence REST APIs are independent of the technology used. You can write both client and server applications in various programming languages without affecting the API design. You can also change the underlying technology on either side without affecting the communication. How do RESTful APIs work? The basic function of a RESTful API is the same as browsing the internet. The client contacts the server by using the API when it requires a resource. API developers explain how the client should use the REST API in the server application API documentation. These are the general steps for any REST API call: The client sends a request to the server. The client follows the API documentation to format the request in a way that the server understands. The server authenticates the client and confirms that the client has the right to make that request. The server receives the request and processes it internally. The server returns a response to the client. The response contains information that tells the client whether the request was successful. The response also includes any information that the client requested. The REST API request and response details vary slightly depending on how the API developers design the API. What does the RESTful API client request contain? RESTful APIs require requests to contain the following main components: Unique resource identifier The server identifies each resource with unique resource identifiers. For REST services, the server typically performs resource identification by using a Uniform Resource Locator (URL). The URL specifies the path to the resource. A URL is similar to the website address that you enter into your browser to visit any webpage. The URL is also called the request endpoint and clearly specifies to the server what the client requires. Method Developers often implement RESTful APIs by using the Hypertext Transfer Protocol (HTTP). An HTTP method tells the server what it needs to do to the resource. The following are four common HTTP methods: GET Clients use GET to access resources that are located at the specified URL on the server. They can cache GET requests and send parameters in the RESTful API request to instruct the server to filter data before sending. POST Clients use POST to send data to the server. They include the data representation with the request. Sending the same POST request multiple times has the side effect of creating the same resource multiple times. PUT Clients use PUT to update existing resources on the server. Unlike POST, sending the same PUT request multiple times in a RESTful web service gives the same result. DELETE Clients use the DELETE request to remove the resource. A DELETE request can change the server state. However, if the user does not have appropriate authentication, the request fails. HTTP headers Request headers are the metadata exchanged between the client and server. For instance, the request header indicates the format of the request and response, provides information about request status, and so on. Data REST API requests might include data for the POST, PUT, and other HTTP methods to work successfully. Parameters RESTful API requests can include parameters that give the server more details about what needs to be done. The following are some different types of parameters: Path parameters that specify URL details. Query parameters that request more information about the resource. Cookie parameters that authenticate clients quickly. What are RESTful API authentication methods? A RESTful web service must authenticate requests before it can send a response. Authentication is the process of verifying an identity. For example, you can prove your identity by showing an ID card or driver's license. Similarly, RESTful service clients must prove their identity to the server to establish trust. RESTful API has four common authentication methods: HTTP authentication HTTP defines some authentication schemes that you can use directly when you are implementing REST API. The following are two of these schemes: Basic authentication In basic authentication, the client sends the user name and password in the request header. It encodes them with base64, which is an encoding technique that converts the pair into a set of 64 characters for safe transmission. Bearer authentication The term bearer authentication refers to the process of giving access control to the token bearer. The bearer token is typically an encrypted string of characters that the server generates in response to a login request. The client sends the token in the request headers to access resources. API keys API keys are another option for REST API authentication. In this approach, the server assigns a unique generated value to a first-time client. Whenever the client tries to access resources, it uses the unique API key to verify itself. API keys are less secure because the client has to transmit the key, which makes it vulnerable to network theft. OAuth OAuth combines passwords and tokens for highly secure login access to any system. The server first requests a password and then asks for an additional token to complete the authorization process. It can check the token at any time and also over time with a specific scope and longevity. What does the RESTful API server response contain? REST principles require the server response to contain the following main components: Status line The status line contains a three-digit status code that communicates request success or failure. For instance, 2XX codes indicate success, but 4XX and 5XX codes indicate errors. 3XX codes indicate URL redirection. The following are some common status codes: 200: Generic success response 201: POST method success response 400: Incorrect request that the server cannot process 404: Resource not found Message body The response body contains the resource representation. The server selects an appropriate representation format based on what the request headers contain. Clients can request information in XML or JSON formats, which define how the data is written in plain text. For example, if the client requests the name and age of a person named John, the server returns a JSON representation as follows: '{\"name\":\"John\", \"age\":30}' Headers The response also contains headers or metadata about the response. They give more context about the response and include information such as the server, encoding, date, and content type. How can AWS help you with RESTful API management? Amazon API Gateway is a fully managed service that makes it easy for developers to create, publish, maintain, monitor, and secure APIs at any scale. Using API Gateway, you can create RESTful APIs for real-time two-way communication applications: Using API Gateway, you can: Provide users with high-speed performance for both API requests and responses. Authorize access to your APIs with AWS Identity and Access Management (IAM) and Amazon. Cognito, both of which provide native OAuth support. Run multiple versions of the same API simultaneously with API Gateway to quickly iterate, test, and release new versions. Monitor performance metrics and information about API calls, data latency, and error rates from the API Gateway. Get started with API Gateway by using our step-by-step guidance and creating an AWS account today. AWS next steps Check out additional product-related resources Learn more about application integration services Sign up for a free account Instant get access to the AWS Free Tier. Sign up for API Gateway free tier Start building in the console Get started building in the AWS management console. Sign in",
    "The WebSocket API (WebSockets) Note: This feature is available in Web Workers . The WebSocket API makes it possible to open a two-way interactive communication session between the user's browser and a server. With this API, you can send messages to a server and receive responses without having to poll the server for a reply. The WebSocket API provides two alternative mechanisms for creating and using web socket connections: the WebSocket interface and the WebSocketStream interface. The WebSocket interface is stable and has good browser and server support. However it doesn't support backpressure . As a result, when messages arrive faster than the application can process them it will either fill up the device's memory by buffering those messages, become unresponsive due to 100% CPU usage, or both. The WebSocketStream interface is a Promise -based alternative to WebSocket . It uses the Streams API to handle receiving and sending messages, meaning that socket connections can take advantage of stream backpressure automatically, regulating the speed of reading or writing to avoid bottlenecks in the application. However, WebSocketStream is non-standard and currently only supported in one rendering engine. Additionally, the WebTransport API is expected to replace the WebSocket API for many applications. WebTransport is a versatile, low-level API that provides backpressure and many other features not supported by either WebSocket or WebSocketStream , such as unidirectional streams, out-of-order delivery, and unreliable data transmission via datagrams. WebTransport is more complex to use than WebSockets and its cross-browser support is not as wide, but it enables the implementation of sophisticated solutions. If standard WebSocket connections are a good fit for your use case and you need wide browser compatibility, you should employ the WebSockets API to get up and running quickly. However, if your application requires a non-standard custom solution, then you should use the WebTransport API. Note: While a WebSocket connection is functionally somewhat similar to standard Unix-style sockets, they are not related. In this article Interfaces Related HTTP headers Guides Tools Specifications Browser compatibility See also Interfaces WebSocket The primary interface for connecting to a WebSocket server and then sending and receiving data on the connection. WebSocketStream Non-standard Promise-based interface for connecting to a WebSocket server; uses streams to send and receive data on the connection. CloseEvent The event sent by the WebSocket object when the connection closes. MessageEvent The event sent by the WebSocket object when a message is received from the server. Related HTTP headers The HTTP headers are used in the WebSocket handshake : Sec-WebSocket-Key An HTTP request header that contains a nonce from the client.\nThis is used in the WebSocket opening handshake to verify that the client explicitly intends to open a WebSocket.\nIt is added automatically by the browser. Sec-WebSocket-Accept An HTTP response header used in the WebSocket opening handshake to indicate that the server is willing to upgrade to a WebSocket connection.\nThe value in the directive is calculated from the value of Sec-WebSocket-Key in the corresponding request. Sec-WebSocket-Version An HTTP header that in requests indicates the version of the WebSocket protocol understood by the client.\nIn responses, it is sent only if the requested protocol version is not supported by the server, and lists the versions that the server supports. Sec-WebSocket-Protocol An HTTP header that in requests indicates the sub-protocols supported by the client in preferred order.\nIn responses, it indicates the sub-protocol selected by the server from the client's preferences. Sec-WebSocket-Extensions An HTTP header that in requests indicates the WebSocket extensions supported by the client in preferred order.\nIn responses, it indicates the extension selected by the server from the client's preferences. Guides Writing WebSocket client applications Writing WebSocket servers Writing a WebSocket server in C# Writing a WebSocket server in Java Writing a WebSocket server in JavaScript (Deno) Using WebSocketStream to write a client Tools AsyncAPI : A specification for describing event-driven architectures based on protocols like WebSocket. You can use it to describe WebSocket-based APIs just as you would describe REST APIs with the OpenAPI specification. Learn why you should consider using AsyncAPI with WebSocket and how to do so . ÂµWebSockets : Highly scalable WebSocket server and client implementation for C++11 and Node.js . Socket.IO : A long polling/WebSocket based third party transfer protocol for Node.js . SocketCluster : A pub/sub WebSocket framework for Node.js with a focus on scalability. WebSocket-Node : A WebSocket server API implementation for Node.js . Total.js : Web application framework for Node.js (Example: WebSocket chat ) SignalR : SignalR will use WebSockets under the covers when it's available, and gracefully fallback to other techniques and technologies when it isn't, while your application code stays the same. Caddy : A web server capable of proxying arbitrary commands (stdin/stdout) as a websocket. ws : a popular WebSocket client & server library for Node.js . cowboy : Cowboy is a small, fast and modern HTTP server for Erlang/OTP with WebSocket support. ZeroMQ : ZeroMQ is embeddable networking library that carries messages across in-process, IPC, TCP, UDP, TIPC, multicast and WebSocket. WebSocket King : A client tool to help develop, test and work with WebSocket servers. PHP WebSocket Server : Server written in PHP to handle connections via websockets wss:// or ws:// and normal sockets over ssl:// , tcp:// Django Channels : Django library that adds support for WebSockets (and other protocols that require long running asynchronous connections). (Phoenix) Channels : Scalable real-time communication using WebSocket in Elixir Phoenix framework. Phoenix LiveView : Real-time interactive web experiences through WebSocket in Elixir Phoenix framework. Flask-SocketIO : gives Flask applications access to low latency bi-directional communications between the clients and the server. Gorilla WebSocket : Gorilla WebSocket is a Go implementation of the WebSocket protocol. Specifications Specification WebSockets # the-websocket-interface Browser compatibility api.WebSocket api.WebSocketStream See also RFC 6455 â\u0080\u0094 The WebSocket Protocol WebSocket API Specification Server-Sent Events Help improve MDN Learn how to contribute This page was last modified on â\u0081¨Feb 9, 2025â\u0081© by MDN contributors . View this page on GitHub â\u0080¢ Report a problem with this content"
]